# Taps
tap "kayac/tap"

# CLI tools
brew "awscli"
brew "chezmoi"
brew "colordiff"
brew "docker"
brew "gh"
brew "graphql-cli"
brew "ipython"
brew "neovim"
brew "ollama"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "rbenv"
brew "rust"
brew "tailscale"
brew "the_silver_searcher"
brew "tree"
brew "uv"

# Work-specific CLI tools
brew "editorconfig-checker"
brew "kayac/tap/ecspresso"
brew "tfenv"

# Cask (macOS apps)
cask "1password"
cask "1password-cli"
cask "bettertouchtool"
cask "claude"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "mactex-no-gui"
cask "notion"
cask "raycast"
cask "session-manager-plugin"
cask "tunnelblick"
cask "warp"
cask "zed"
